#3
def print_pack_report(n):
    """Выводит отчет о возможности фасовки пирожных в коробки по 3 и по 5 штук.

    Перебирает числа от n до 1 в порядке убывания.
    """
    for i in range(n, 0, -1):
        # 1. Проверяем деление на 15
        if i % 3 == 0 and i % 5 == 0:
            print(f"{i} - расфасуем по 3 или по 5")

        elif i % 5 == 0:
            print(f"{i} - расфасуем по 5")

        elif i % 3 == 0:
            print(f"{i} - расфасуем по 3")

        else:
            print(f"{i} - не заказываем!")
x = int(input())
print_pack_report(x)